import random
start = input(
    "Приветствую! Рады видеть тебя в одной из увлекательной и фартовой игре в мире :)\nГотов ли ты попытать свою удачу?(Выбери да/нет):")
if start == "да":
    print("\nСупер! Давай поскорее начнём играть)")
    choice = ""
    while True:
        money = input("Cколько ты хочешь поставить?:")
        stavka = input(
            "Выбери из переченя:'число','красное/чёрное','старшинство(1-18/19-36)','ряд,'совокупность чисел','столбец','посл 1-12/13-24/25-36',чётное/нечётное':"  )
        my_list = [money]
        listruletki = {
            "0": {"чётное": True},
            "1": {
                "число": 1,
                "чётное": False,
                "цвет": "красный",
                "ряд": "1",
                "столбец": "1",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "1/12",
                "совокупность чисел": ["1/2", "1/4", "1/2/4/5", "1/2/3/4/5/6"],
            },
            "2": {
                "чётное": True,
                "цвет": "чёрный",
                "ряд": "2",
                "столбец": "1",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "1/12",
                "совокупность чисел": [
                    "1/2",
                    "2/3",
                    "2/5",
                    "1/2/4/5",
                    "2/3/5/6",
                    "1/2/3/4/5/6",
                ],
            },
            "3": {
                "чётное": False,
                "цвет": "красный",
                "ряд": "3",
                "столбец": "1",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "1/12",
                "совокупность чисел": ["2/3", "3/6", "2/3/5/6", "1/2/3/4/5/6"],
            },
            "4": {
                "чётное": True,
                "цвет": "чёрный",
                "ряд": "1",
                "столбец": "2",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "1/12",
                "совокупность чисел": [
                    "1/4",
                    "4/5",
                    "4/7",
                    "1/2/4/5",
                    "4/5/7/8",
                    "1/2/3/4/5/6",
                    "4/5/6/7/8/9",
                ],
            },
            "5": {
                "чётное": False,
                "цвет": "красный",
                "ряд": "2",
                "столбец": "2",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "1/12",
                "совокупность чисел": [
                    "4/5",
                    "2/5",
                    "5/6",
                    "5/8",
                    "1/2/4/5",
                    "4/5/7/8",
                    "2/3/5/6",
                    "5/6/8/9",
                    "1/2/3/4/5/6",
                    "4/5/6/7/8/9",
                ],
            },
            "6": {
                "чётное": True,
                "цвет": "чёрный",
                "ряд": "3",
                "столбец": "2",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "1/12",
                "совокупность чисел": [
                    "5/6",
                    "3/6",
                    "6/9",
                    "2/3/5/6",
                    "5/6/8/9",
                    "1/2/3/4/5/6",
                    "4/5/6/7/8/9",
                ],
            },
            "7": {
                "чётное": False,
                "цвет": "красный",
                "ряд": "1",
                "столбец": "3",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "1/12",
                "совокупность чисел": [
                    "4/7",
                    "7/8",
                    "7/10",
                    "4/5/7/8",
                    "7/8/10/11",
                    "4/5/6/7/8/9",
                    "7/8/9/10/11/12",
                ],
            },
            "8": {
                "чётное": True,
                "цвет": "чёрный",
                "ряд": "2",
                "столбец": "3",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "1/12",
                "совокупность чисел": [
                    "7/8",
                    "8/9",
                    "5/8",
                    "8/11",
                    "4/5/7/8",
                    "5/6/8/9",
                    "7/8/10/11",
                    "8/9/11/12",
                    "7/8/9/10/11/12",
                    "4/5/6/7/8/9",
                ],
            },
            "9": {
                "чётное": False,
                "цвет": "красный",
                "ряд": "3",
                "столбец": "3",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "1/12",
                "совокупность чисел": [
                    "6/9",
                    "8/9",
                    "9/12",
                    "5/6/8/9",
                    "8/9/11/12",
                    "4/5/6/7/8/9",
                    "7/8/9/10/11/12",
                ],
            },
            "10": {
                "чётное": True,
                "цвет": "чёрный",
                "ряд": "1",
                "столбец": "4",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "1/12",
                "совокупность чисел": [
                    "7/10",
                    "10/11",
                    "10/13",
                    "7/8/10/11",
                    "10/11/13/14",
                    "7/8/9/10/11/12",
                    "10/11/12/13/14/15",
                ],
            },
            "11": {
                "чётное": False,
                "цвет": "чёрный",
                "ряд": "2",
                "столбец": "4",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "1/12",
                "совокупность чисел": [
                    "10/11",
                    "11/12",
                    "8/11",
                    "11/14",
                    "7/8/10/11",
                    "8/9/11/12",
                    "10/11/13/14",
                    "11/12/14/15",
                    "7/8/9/10/11/12",
                    "10/11/12/13/14/15",
                ],
            },
            "12": {
                "чётное": True,
                "цвет": "красный",
                "ряд": "3",
                "столбец": "4",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "1/12",
                "совокупность чисел": [
                    "9/12",
                    "11/12",
                    "12/15",
                    "8/9/11/12",
                    "11/12/14/15",
                    "7/8/9/10/11/12",
                    "10/11/12/13/14/15",
                ],
            },
            "13": {
                "чётное": False,
                "цвет": "чёрный",
                "ряд": "1",
                "столбец": "5",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "13/24",
                "совокупность чисел": [
                    "10/13",
                    "13/14",
                    "13/16",
                    "10/11/13/14",
                    "13/14/16/17",
                    "10/11/12/13/14/15",
                    "13/14/15/16/17/18",
                ],
            },
            "14": {
                "чётное": True,
                "цвет": "красный",
                "ряд": "2",
                "столбец": "5",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "13/24",
                "совокупность чисел": [
                    "13/14",
                    "11/14",
                    "14/15",
                    "14/17",
                    "10/11/13/14",
                    "11/12/14/15",
                    "13/14/16/17",
                    "14/15/17/18",
                    "10/11/12/13/14/15",
                    "13/14/15/16/17/18",
                ],
            },
            "15": {
                "чётное": False,
                "цвет": "чёрный",
                "ряд": "3",
                "столбец": "5",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "13/24",
                "совокупность чисел": [
                    "12/15",
                    "14/15",
                    "15/18",
                    "11/12/14/15",
                    "14/15/17/18",
                    "10/11/12/13/14/15",
                    "13/14/15/16/17/18",
                ],
            },
            "16": {
                "чётное": True,
                "цвет": "красный",
                "ряд": "1",
                "столбец": "6",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "13/24",
                "совокупность чисел": [
                    "13/16",
                    "16/17",
                    "16/19",
                    "13/14/16/17",
                    "16/17/19/20",
                    "13/14/15/16/17/18",
                    "16/17/18/19/20/21",
                ],
            },
            "17": {
                "чётное": False,
                "цвет": "чёрный",
                "ряд": "2",
                "столбец": "6",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "13/24",
                "совокупность чисел": [
                    "14/17",
                    "16/17",
                    "17/18",
                    "17/20",
                    "13/14/16/17",
                    "14/15/17/18",
                    "16/17/19/20",
                    "17/18/20/21",
                    "13/14/15/16/17/18",
                    "16/17/18/19/20/21",
                ],
            },
            "18": {
                "чётное": True,
                "цвет": "красный",
                "ряд": "3",
                "столбец": "6",
                "старшинство": "1/18",
                "послед 1/12,13/24,25/36": "13/24",
                "совокупность чисел": [
                    "15/18",
                    "17/18",
                    "18/21",
                    "14/15/17/18",
                    "17/18/20/21",
                    "13/14/15/16/17/18",
                    "16/17/18/19/20/21",
                ],
            },
            "19": {
                "чётное": False,
                "цвет": "красный",
                "ряд": "1",
                "столбец": "7",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "13/24",
                "совокупность чисел": [
                    "16/19",
                    "19/20",
                    "19/22",
                    "16/17/19/20",
                    "19/20/22/23",
                    "16/17/18/19/20/21",
                    "19/20/21/22/23/24",
                ],
            },
            "20": {
                "чётное": True,
                "цвет": "чёрный",
                "ряд": "2",
                "столбец": "7",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "13/24",
                "совокупность чисел": [
                    "17/20",
                    "19/20",
                    "20/21",
                    "20/23",
                    "16/17/19/20",
                    "17/18/20/21",
                    "19/20/22/23",
                    "20/21/23/24",
                    "16/17/18/19/20/21",
                    "19/20/21/22/23/24",
                ],
            },
            "21": {
                "чётное": False,
                "цвет": "красный",
                "ряд": "3",
                "столбец": "7",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "13/24",
                "совокупность чисел": [
                    "18/21",
                    "20/21",
                    "21/24",
                    "17/18/20/21",
                    "20/21/23/24",
                    "16/17/18/19/20/21",
                ],
            },
            "22": {
                "чётное": True,
                "цвет": "чёрный",
                "ряд": "1",
                "столбец": "8",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "13/24",
                "совокупность чисел": [
                    "19/22",
                    "22/23",
                    "22/25",
                    "19/20/22/23",
                    "22/23/25/26",
                    "19/20/21/22/23/24",
                    "22/23/24/25/26",
                ],
            },
            "23": {
                "чётное": False,
                "цвет": "красный",
                "ряд": "2",
                "столбец": "8",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "13/24",
                "совокупность чисел": [
                    "22/23",
                    "20/23",
                    "23/24",
                    "23/26",
                    "19/20/22/23",
                    "20/21/23/24",
                    "22/23/25/26",
                    "23/24/26/27",
                    "19/20/21/22/23/24",
                    "22/23/24/25/26/27",
                ],
            },
            "24": {
                "чётное": True,
                "цвет": "чёрный",
                "ряд": "3",
                "столбец": "8",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "13/24",
                "совокупность чисел": [
                    "21/24",
                    "23/24",
                    "24/27",
                    "20/21/23/24",
                    "23/24/26/27",
                    "19/20/21/22/23/24",
                    "22/23/24/25/26/27",
                ],
            },
            "25": {
                "чётное": False,
                "цвет": "красный",
                "ряд": "1",
                "столбец": "9",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "25/36",
                "совокупность чисел": [
                    "22/25",
                    "25/26",
                    "25/28",
                    "22/23/25/26",
                    "25/26/28/29",
                    "22/23/24/25/26/27",
                    "25/26/27/28/29/30",
                ],
            },
            "26": {
                "чётное": True,
                "цвет": "чёрный",
                "ряд": "2",
                "столбец": "9",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "25/36",
                "совокупность чисел": [
                    "25/26",
                    "23/26",
                    "26/27",
                    "26/29",
                    "22/23/25/26",
                    "23/24/26/27",
                    "25/26/28/29",
                    "26/27/29/30",
                    "22/23/24/25/26/27",
                    "25/26/27/28/29/30",
                ],
            },
            "27": {
                "чётное": False,
                "цвет": "красный",
                "ряд": "3",
                "столбец": "9",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "25/36",
                "совокупность чисел": [
                    "26/27",
                    "24/27",
                    "27/30",
                    "23/24/26/27",
                    "26/27/29/30",
                    "22/23/24/25/26/27",
                    "25/26/27/28/29/30",
                ],
            },
            "28": {
                "чётное": True,
                "цвет": "чёрный",
                "ряд": "1",
                "столбец": "10",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "25/36",
                "совокупность чисел": [
                    "25/28",
                    "28/29",
                    "28/31",
                    "25/26/28/29",
                    "28/29/31/32",
                    "28/29/30/31/32/33",
                    "25/26/27/28/29/30",
                ],
            },
            "29": {
                "чётное": False,
                "цвет": "чёрный",
                "ряд": "2",
                "столбец": "10",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "25/36",
                "совокупность чисел": [
                    "28/29",
                    "26/29",
                    "29/30",
                    "29/32",
                    "25/26/28/29",
                    "26/27/29/30",
                    "28/29/31/32",
                    "29/30/32/33",
                    "25/26/27/28/29/30",
                    "28/29/30/31/32/33",
                ],
            },
            "30": {
                "чётное": True,
                "цвет": "красный",
                "ряд": "3",
                "столбец": "10",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "25/36",
                "совокупность чисел": [
                    "29/30",
                    "27/30",
                    "30/33",
                    "26/27/29/30",
                    "29/30/32/33",
                    "28/29/30/31/32/33",
                    "25/26/27/28/29/30",
                ],
            },
            "31": {
                "чётное": False,
                "цвет": "чёрный",
                "ряд": "1",
                "столбец": "11",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "25/36",
                "совокупность чисел": [
                    "28/31",
                    "31/32",
                    "31/34",
                    "28/29/31/32",
                    "31/32/34/35",
                    "28/29/30/31/32/33",
                    "31/32/33/34/35/36",
                ],
            },
            "32": {
                "чётное": True,
                "цвет": "красный",
                "ряд": "2",
                "столбец": "11",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "25/36",
                "совокупность чисел": [
                    "31/32",
                    "29/32",
                    "32/33",
                    "32/35",
                    "28/29/31/32",
                    "29/30/32/33",
                    "31/32/34/35",
                    "32/33/35/36",
                    "28/29/30/31/32/33",
                    "31/32/33/34/35/36",
                ],
            },
            "33": {
                "чётное": False,
                "цвет": "чёрный",
                "ряд": "3",
                "столбец": "11",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "25/36",
                "совокупность чисел": [
                    "32/33",
                    "30/33",
                    "33/36",
                    "29/30/32/33",
                    "32/33/35/36",
                    "28/29/30/31/32/33",
                    "31/32/33/34/35/36",
                ],
            },
            "34": {
                "чётное": True,
                "цвет": "красный",
                "ряд": "1",
                "столбец": "12",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "25/36",
                "совокупность чисел": [
                    "31/34",
                    "34/35",
                    "31/32/34/35",
                    "31/32/33/34/35/36",
                ],
            },
            "35": {
                "чётное": False,
                "цвет": "чёрный",
                "ряд": "2",
                "столбец": "12",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "25/36",
                "совокупность чисел": [
                    "34/35",
                    "32/35",
                    "35/36",
                    "31/32/34/35",
                    "32/33/35/36",
                    "31/32/33/34/35/36",
                ],
            },
            "36": {
                "чётное": True,
                "цвет": "красный",
                "ряд": "3",
                "столбец": "12",
                "старшинство": "19/36",
                "послед 1/12,13/24,25/36": "25/36",
                "совокупность чисел": [
                    "35/36",
                    "33/36",
                    "32/33/35/36",
                    "31/32/33/34/35/36",
                ],
            },
        }

        if stavka == "число":
            choice = input("Какое именно число от 0 дро 36 ты хочешь выбрать?:") # 1
            my_list.append(choice)
            continue

        if stavka == "красное/чёрное":
            user1 = input("Какой именно цвет ты хочешь выбрать?:")
            my_list.append(user1)
            continue

        if stavka == "старшинство(1-18/19-36)":
            user2 = input("Какую именно последовательность ты хочешь выбрать?:")
            my_list.append(user2)
            continue

        if stavka == "ряд":
            user3 = input("Какой именно ряд ты хочешь выбрать(1,2,3)?:")
            my_list.append(user3)

        if stavka == "cовокупность чисел":
            user4 = input(
                "Какую именно совокупность чисел ты хочешь выбрать?(напиши её через слэш):"
            )
            my_list.append(user4)
            continue

        if stavka == "столбец":
            user5 = input("Какой именно столбец ты хочешь выбрать?(1-12):")
            my_list.append(user5)
            continue

        if stavka == "последователность 1-12/13-24/25-36":
            user6 = input(
                "Какую именно последовательность ты хочешь выбрать?(1-12/13-24/25-36):"
            )
            my_list.append(user6)
            continue

        if stavka == "чётное/нечётное":
            user7 = input("Ты выберишь чётное или нечётное?:")
            my_list.append(user7)
            continue

        again = input("Хочешь сделать ещё ставку?(да/нет):")
        if again == "да":
            continue

        if again == "нет":
            rand = random.choice(list(listruletki))
            print(rand) # 1
            # stavka == "число":
            # choice = 1
            # do something
            if listruletki[choice][stavka] == choice:
                money += 1
            
            break


if start == "нет":
    print("\nПечально :(\nНо ты заходи если что. До следующего раза :)")
