import random
start=input("Приветствую! Рады видеть тебя в одной из увлекательной и фартовой игре в мире :)\nГотов ли ты попытать свою удачу?(Выбери да/нет):")
try:
    start=str(start)
except ValueError:
    print("Ошибка,попробуй ещё раз :)")


if start=="да":
    print("\nСупер! Давай поскорее начнём играть)")
    choice=""

    while True:
        money=input('Cколько ты хочешь поставить?:')
        bet=input("Выбери из переченя:'число','красное/чёрное','старшинство(1-18/19-36)','ряд,'совокупность чисел','столбец','посл 1-12/13-24/25-36',чётное/нечётное':")
        my_list=[money]
        list_of_roulette={"0":{"число":0,"чётное":True},
                     "1": {"число":1,"чётное":False, "цвет":"красный","ряд":"1","столбец":"1","старшинство":"1/18", "послед 1/12,13/24,25/36":"1/12","совокупность чисел":["1/2","1/4","1/2/4/5","1/2/3/4/5/6"]},
                     "2": {"число":2,"чётное":True, "цвет":"чёрный","ряд":"2","столбец":"1","старшинство":"1/18", "послед 1/12,13/24,25/36":"1/12","совокупность чисел":["1/2","2/3","2/5", "1/2/4/5","2/3/5/6","1/2/3/4/5/6"]},
                     "3":{"число":3,"чётное":False, "цвет":"красный","ряд":"3","столбец":"1","старшинство":"1/18", "послед 1/12,13/24,25/36":"1/12","совокупность чисел":["2/3","3/6", "2/3/5/6","1/2/3/4/5/6"]},
                     "4":{"число":4,"чётное":True, "цвет":"чёрный","ряд":"1","столбец":"2","старшинство":"1/18", "послед 1/12,13/24,25/36":"1/12","совокупность чисел":["1/4","4/5","4/7","1/2/4/5","4/5/7/8","1/2/3/4/5/6","4/5/6/7/8/9"]},
                     "5":{"число":5,"чётное":False, "цвет":"красный","ряд":"2","столбец":"2","старшинство":"1/18", "послед 1/12,13/24,25/36":"1/12","совокупность чисел":["4/5","2/5","5/6","5/8","1/2/4/5","4/5/7/8","2/3/5/6","5/6/8/9","1/2/3/4/5/6","4/5/6/7/8/9"]},
                     "6":{"число":6,"чётное":True, "цвет":"чёрный","ряд":"3","столбец":"2","старшинство":"1/18", "послед 1/12,13/24,25/36":"1/12","совокупность чисел":["5/6","3/6","6/9","2/3/5/6","5/6/8/9","1/2/3/4/5/6","4/5/6/7/8/9"]},
                     "7":{"число":7,"чётное":False, "цвет":"красный","ряд":"1","столбец":"3","старшинство":"1/18", "послед 1/12,13/24,25/36":"1/12","совокупность чисел":["4/7","7/8","7/10","4/5/7/8","7/8/10/11","4/5/6/7/8/9","7/8/9/10/11/12"]},
                     "8":{"число":8,"чётное":True, "цвет":"чёрный","ряд":"2","столбец":"3","старшинство":"1/18", "послед 1/12,13/24,25/36":"1/12","совокупность чисел":["7/8","8/9","5/8","8/11","4/5/7/8","5/6/8/9","7/8/10/11","8/9/11/12","7/8/9/10/11/12","4/5/6/7/8/9"]},
                     "9":{"число":9,"чётное":False, "цвет":"красный","ряд":"3","столбец":"3","старшинство":"1/18", "послед 1/12,13/24,25/36":"1/12","совокупность чисел":["6/9","8/9","9/12","5/6/8/9","8/9/11/12","4/5/6/7/8/9","7/8/9/10/11/12"]},
                     "10":{"число":10,"чётное":True, "цвет":"чёрный","ряд":"1","столбец":"4","старшинство":"1/18", "послед 1/12,13/24,25/36":"1/12","совокупность чисел":["7/10","10/11","10/13","7/8/10/11","10/11/13/14","7/8/9/10/11/12","10/11/12/13/14/15"]},
                     "11":{"число":11,"чётное":False, "цвет":"чёрный","ряд":"2","столбец":"4","старшинство":"1/18", "послед 1/12,13/24,25/36":"1/12","совокупность чисел":["10/11","11/12","8/11","11/14","7/8/10/11","8/9/11/12","10/11/13/14","11/12/14/15","7/8/9/10/11/12","10/11/12/13/14/15"]},
                     "12":{"число":12,"чётное":True, "цвет":"красный","ряд":"3","столбец":"4","старшинство":"1/18", "послед 1/12,13/24,25/36":"1/12","совокупность чисел":["9/12","11/12","12/15","8/9/11/12","11/12/14/15","7/8/9/10/11/12","10/11/12/13/14/15"]},
                     "13":{"число":13,"чётное":False, "цвет":"чёрный","ряд":"1","столбец":"5","старшинство":"1/18", "послед 1/12,13/24,25/36":"13/24","совокупность чисел":["10/13","13/14","13/16","10/11/13/14","13/14/16/17","10/11/12/13/14/15","13/14/15/16/17/18"]},
                     "14":{"число":14,"чётное":True, "цвет":"красный","ряд":"2","столбец":"5","старшинство":"1/18", "послед 1/12,13/24,25/36":"13/24","совокупность чисел":["13/14","11/14","14/15","14/17","10/11/13/14","11/12/14/15","13/14/16/17","14/15/17/18","10/11/12/13/14/15","13/14/15/16/17/18"]},
                     "15":{"число":15,"чётное":False, "цвет":"чёрный","ряд":"3","столбец":"5","старшинство":"1/18", "послед 1/12,13/24,25/36":"13/24","совокупность чисел":["12/15","14/15","15/18","11/12/14/15","14/15/17/18","10/11/12/13/14/15","13/14/15/16/17/18"]},
                     "16":{"число":16,"чётное":True, "цвет":"красный","ряд":"1","столбец":"6","старшинство":"1/18", "послед 1/12,13/24,25/36":"13/24","совокупность чисел":["13/16","16/17","16/19","13/14/16/17","16/17/19/20","13/14/15/16/17/18","16/17/18/19/20/21"]},
                     "17":{"число":17,"чётное":False, "цвет":"чёрный","ряд":"2","столбец":"6","старшинство":"1/18", "послед 1/12,13/24,25/36":"13/24","совокупность чисел":["14/17","16/17","17/18","17/20","13/14/16/17","14/15/17/18","16/17/19/20","17/18/20/21","13/14/15/16/17/18","16/17/18/19/20/21"]},
                     "18":{"число":18,"чётное":True, "цвет":"красный","ряд":"3","столбец":"6","старшинство":"1/18", "послед 1/12,13/24,25/36":"13/24","совокупность чисел":["15/18","17/18","18/21","14/15/17/18","17/18/20/21","13/14/15/16/17/18","16/17/18/19/20/21"]},
                     "19":{"число":19,"чётное":False, "цвет":"красный","ряд":"1","столбец":"7","старшинство":"19/36", "послед 1/12,13/24,25/36":"13/24","совокупность чисел":["16/19","19/20","19/22","16/17/19/20","19/20/22/23","16/17/18/19/20/21","19/20/21/22/23/24"]},
                     "20":{"число":20,"чётное":True, "цвет":"чёрный","ряд":"2","столбец":"7","старшинство":"19/36", "послед 1/12,13/24,25/36":"13/24","совокупность чисел":["17/20","19/20","20/21","20/23","16/17/19/20","17/18/20/21","19/20/22/23","20/21/23/24","16/17/18/19/20/21","19/20/21/22/23/24"]},
                     "21":{"число":21,"чётное":False, "цвет":"красный","ряд":"3","столбец":"7","старшинство":"19/36", "послед 1/12,13/24,25/36":"13/24","совокупность чисел":["18/21","20/21","21/24","17/18/20/21","20/21/23/24","16/17/18/19/20/21"]},
                     "22":{"число":22,"чётное":True, "цвет":"чёрный","ряд":"1","столбец":"8","старшинство":"19/36", "послед 1/12,13/24,25/36":"13/24","совокупность чисел":["19/22","22/23","22/25","19/20/22/23","22/23/25/26","19/20/21/22/23/24","22/23/24/25/26"]},
                     "23":{"число":23,"чётное":False, "цвет":"красный","ряд":"2","столбец":"8","старшинство":"19/36", "послед 1/12,13/24,25/36":"13/24","совокупность чисел":["22/23","20/23","23/24","23/26","19/20/22/23","20/21/23/24","22/23/25/26","23/24/26/27","19/20/21/22/23/24","22/23/24/25/26/27"]},
                     "24":{"число":24,"чётное":True, "цвет":"чёрный","ряд":"3","столбец":"8","старшинство":"19/36", "послед 1/12,13/24,25/36":"13/24","совокупность чисел":["21/24","23/24","24/27","20/21/23/24","23/24/26/27","19/20/21/22/23/24","22/23/24/25/26/27"]},
                     "25":{"число":25,"чётное":False, "цвет":"красный","ряд":"1","столбец":"9","старшинство":"19/36", "послед 1/12,13/24,25/36":"25/36","совокупность чисел":["22/25","25/26","25/28","22/23/25/26","25/26/28/29","22/23/24/25/26/27","25/26/27/28/29/30"]},
                     "26":{"число":26,"чётное":True, "цвет":"чёрный","ряд":"2","столбец":"9","старшинство":"19/36", "послед 1/12,13/24,25/36":"25/36","совокупность чисел":["25/26","23/26","26/27","26/29","22/23/25/26","23/24/26/27","25/26/28/29","26/27/29/30","22/23/24/25/26/27","25/26/27/28/29/30"]},
                     "27":{"число":27,"чётное":False, "цвет":"красный","ряд":"3","столбец":"9","старшинство":"19/36", "послед 1/12,13/24,25/36":"25/36","совокупность чисел":["26/27","24/27","27/30","23/24/26/27","26/27/29/30","22/23/24/25/26/27","25/26/27/28/29/30"]},
                     "28":{"число":28,"чётное":True, "цвет":"чёрный","ряд":"1","столбец":"10","старшинство":"19/36", "послед 1/12,13/24,25/36":"25/36","совокупность чисел":["25/28","28/29","28/31","25/26/28/29","28/29/31/32","28/29/30/31/32/33","25/26/27/28/29/30"]},
                     "29":{"число":29,"чётное":False, "цвет":"чёрный","ряд":"2","столбец":"10","старшинство":"19/36", "послед 1/12,13/24,25/36":"25/36","совокупность чисел":["28/29","26/29","29/30","29/32","25/26/28/29","26/27/29/30","28/29/31/32","29/30/32/33","25/26/27/28/29/30","28/29/30/31/32/33"]},
                     "30":{"число":30,"чётное":True, "цвет":"красный","ряд":"3","столбец":"10","старшинство":"19/36", "послед 1/12,13/24,25/36":"25/36","совокупность чисел":["29/30","27/30","30/33","26/27/29/30","29/30/32/33","28/29/30/31/32/33","25/26/27/28/29/30"]},
                     "31":{"число":31,"чётное":False, "цвет":"чёрный","ряд":"1","столбец":"11","старшинство":"19/36", "послед 1/12,13/24,25/36":"25/36","совокупность чисел":["28/31","31/32","31/34","28/29/31/32","31/32/34/35","28/29/30/31/32/33","31/32/33/34/35/36"]},
                     "32":{"число":32,"чётное":True, "цвет":"красный","ряд":"2","столбец":"11","старшинство":"19/36", "послед 1/12,13/24,25/36":"25/36","совокупность чисел":["31/32","29/32","32/33","32/35","28/29/31/32","29/30/32/33","31/32/34/35","32/33/35/36","28/29/30/31/32/33","31/32/33/34/35/36"]},
                     "33":{"число":33,"чётное":False, "цвет":"чёрный","ряд":"3","столбец":"11","старшинство":"19/36", "послед 1/12,13/24,25/36":"25/36","совокупность чисел":["32/33","30/33","33/36" ,"29/30/32/33","32/33/35/36","28/29/30/31/32/33","31/32/33/34/35/36"]},
                     "34":{"число":34,"чётное":True, "цвет":"красный","ряд":"1","столбец":"12","старшинство":"19/36", "послед 1/12,13/24,25/36":"25/36","совокупность чисел":["31/34","34/35","31/32/34/35","31/32/33/34/35/36"]},
                     "35":{"число":35,"чётное":False, "цвет":"чёрный","ряд":"2","столбец":"12","старшинство":"19/36", "послед 1/12,13/24,25/36":"25/36","совокупность чисел":["34/35","32/35","35/36","31/32/34/35","32/33/35/36","31/32/33/34/35/36"]},
                     "36":{"число":36,"чётное":True, "цвет":"красный","ряд":"3","столбец":"12","старшинство":"19/36", "послед 1/12,13/24,25/36":"25/36","совокупность чисел":["35/36","33/36","32/33/35/36","31/32/33/34/35/36"]}

                     }



        if bet=='число':
            choice=input("Какое именно число от 0 дро 36 ты хочешь выбрать?:")
            my_list.append(choice)


        if bet=='красное/чёрное':
            choice=input("Какой именно цвет ты хочешь выбрать?:")
            my_list.append(choice)


        if bet=='старшинство(1-18/19-36)':
            choice = input("Какую именно последовательность ты хочешь выбрать?:")
            my_list.append(choice)


        if bet=="ряд":
            choice = input("Какой именно ряд ты хочешь выбрать(1,2,3)?:")
            my_list.append(choice)



        if bet=='cовокупность чисел':
            choice = input("Какую именно совокупность чисел ты хочешь выбрать?(напиши её через слэш):")
            my_list.append(choice)


        if bet=='столбец':
            choice = input("Какой именно столбец ты хочешь выбрать?(1-12):")
            my_list.append(choice)


        if bet=='последователность 1-12/13-24/25-36':
            choice = input("Какую именно последовательность ты хочешь выбрать?(1-12/13-24/25-36):")
            my_list.append(choice)


        if bet=='чётное/нечётное':
            choice = input("Ты выберишь чётное или нечётное?:")
            my_list.append(choice)


        again = input('Хочешь сделать ещё ставку?(да/нет):')
        if again == 'да':
            continue
        if again == 'нет':
            print("Рулетка крутиться!\nКто знает, может тебе сегодня улыбнётся удача??\nНа рулетке выпало:")
            rand=random.choice(list(list_of_roulette))
            print(rand)

            if list_of_roulette[choice][bet]==choice:
                money +=1
                print("Ты выиграл! Вот твой выигрыш:",money)
            else:
                print("Ты проиграл, но не расстраивайся :)")


                break
        ending=input('\nТы хочешь ещё раз сыграть?:')
        if ending=="да":
            continue
        if ending=='нет':
            break

if start=="нет":
    print("\nПечально :(\nНо ты заходи если что. До следующего раза :)")
